#include <iostream.h>
/* 该习题出现在第3章，所以在以下给出的参考答案中
   没有给出循环结构的解题方法。同学们可以用循环结
   构改写本程序。
   */
void main()
{
	int n, m,k=0;
	cout<<"输入一个不多于5位的正整数： "<<endl;
	cin>>n;
	if( n/10 == 0)
		k = 1;
	else if( n/100 == 0)
			k = 2;
		else if ( n/1000 == 0)
				k = 3;
			else if( n/10000 == 0)
					k = 4;
				else 
		            k = 5;
	cout<<n<<"是"<<k<<"位数"<<endl;
	
	switch(k)
	{
	case 1:
		cout<<"各位数字是： "<<n<<endl;
		cout<<"逆序数字是： "<<n<<endl;
		break;
	case 2:
		cout<<"各位数字是： "<<n/10<<","<<n%10<<endl;
		cout<<"逆序数字是： "<<n%10<<","<<n/10<<endl;
		break;
	case 3:
		cout<<"各位数字是： "<<n/100<<","
							 <<(n/10)%10<<","
							 <<n%10<<endl;
		cout<<"逆序数字是： "<<n%10<<","
							 <<(n/10)%10<<","
							 <<n/100<<endl;
		break;
	case 4:
		cout<<"各位数字是： "<<n/1000<<","
							 <<(n/100)%10<<","
							 <<(n/10)%10<<","
							 <<n%10<<endl;
		cout<<"逆序数字是： "<<n%10<<","
							 <<(n/10)%10<<","
							 <<(n/100)%10<<","
							 <<n/1000<<endl;
		break;
	case 5:
		cout<<"各位数字是： "<<n/10000<<","
							 <<(n/1000)%10<<","
							 <<(n/100)%10<<","
							 <<(n/10)%10<<","
							 <<n%10<<endl;
		cout<<"逆序数字是： "<<n%10<<","
							 <<(n/10)%10<<","
							 <<(n/100)%10<<","
							 <<(n/1000)%10<<","
							 <<n/10000<<endl;
	}
}
	